20220511214456-dns.org
:PROPERTIES:
:ID:       37d123b1-4c01-4763-b637-6c4d17c193f6
:END:
#+title: DNS
* 概要
DNS(Domain Name System)はコンピュータが参照しているIPアドレスと、人間が識別しやすい表記のドメイン情報を管理するシステム。

例: [[id:d17ea774-2739-44f3-89dc-97a86b2c7bf7][AWS]] Route53はDNSのフルマネージドサービス。
* Memo
** レコードの種類
- SOA :: ゾーン情報
- NS :: DNSサーバ名
- A :: ホストのIPアドレス
- PTR :: IPアドレスに対するホスト名
- CNAME :: ホスト名のエイリアス
- MX :: ドメインのメール・サーバ名
- HINFO :: ホストの追加情報
- WKS :: ホストで実行されているサービス情報
- TXT :: ホストへのテキスト情報

[[https://atmarkit.itmedia.co.jp/fnetwork/rensai/dns01/dns-record.html][主なDNSレコードの種類－ ＠IT]]

そのほか、サービスよって独自拡張レコードが存在する。
** サブドメイン設定
[[id:9f6b36fd-a680-42db-a6f4-0ea21b355bc2][Terraform]]によるサブドメイン設定方法。
また、サブドメインもまとめてHTTPS化するため、ワイルドカードを含んだSSL証明書を発行する。

[[https://budougumi0617.github.io/2020/11/07/define_https_subdomain_by_terraform/][TerraformでAWS上にHTTPS化したサブドメインを定義する - My External Storage]]
* Tasks
* Reference
* Archives
