20220511214456-dns.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-08-07 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>DNS</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel="preconnect" href="https://fonts.googleapis.com"><link rel="preconnect" href="https://fonts.gstatic.com" crossorigin><link href="https://fonts.googleapis.com/css2?family=Ultra&display=swap" rel="stylesheet"><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">DNS</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4bed5b1">概要</a></li>
<li><a href="#org5654e18">Memo</a>
<ul>
<li><a href="#org78afe4b">レコードの種類</a></li>
<li><a href="#org3dc4480">サブドメイン設定</a></li>
</ul>
</li>
<li><a href="#org474708c">Tasks</a></li>
<li><a href="#org8d5cef2">Reference</a></li>
<li><a href="#orgf6cea2a">Archives</a></li>
</ul>
</div>
</div>
<div id="outline-container-org4bed5b1" class="outline-2">
<h2 id="org4bed5b1"><a href="#org4bed5b1">概要</a></h2>
<div class="outline-text-2" id="text-org4bed5b1">
<p>
DNS(Domain Name System)はコンピュータが参照しているIPアドレスと、人間が識別しやすい表記のドメイン情報を管理するシステム。
</p>

<p>
例: <a href="20211221000645-aws.html#ID-d17ea774-2739-44f3-89dc-97a86b2c7bf7">AWS</a> Route53はDNSのフルマネージドサービス。
</p>
</div>
</div>
<div id="outline-container-org5654e18" class="outline-2">
<h2 id="org5654e18"><a href="#org5654e18">Memo</a></h2>
<div class="outline-text-2" id="text-org5654e18">
</div>
<div id="outline-container-org78afe4b" class="outline-3">
<h3 id="org78afe4b"><a href="#org78afe4b">レコードの種類</a></h3>
<div class="outline-text-3" id="text-org78afe4b">
<dl class="org-dl">
<dt>SOA</dt><dd>ゾーン情報</dd>
<dt>NS</dt><dd>DNSサーバ名</dd>
<dt>A</dt><dd>ホストのIPアドレス</dd>
<dt>PTR</dt><dd>IPアドレスに対するホスト名</dd>
<dt>CNAME</dt><dd>ホスト名のエイリアス</dd>
<dt>MX</dt><dd>ドメインのメール・サーバ名</dd>
<dt>HINFO</dt><dd>ホストの追加情報</dd>
<dt>WKS</dt><dd>ホストで実行されているサービス情報</dd>
<dt>TXT</dt><dd>ホストへのテキスト情報</dd>
</dl>

<p>
<a href="https://atmarkit.itmedia.co.jp/fnetwork/rensai/dns01/dns-record.html">主なDNSレコードの種類－ ＠IT</a>
</p>

<p>
そのほか、サービスよって独自拡張レコードが存在する。
</p>
</div>
</div>
<div id="outline-container-org3dc4480" class="outline-3">
<h3 id="org3dc4480"><a href="#org3dc4480">サブドメイン設定</a></h3>
<div class="outline-text-3" id="text-org3dc4480">
<p>
<a href="20210922010846-terraform.html#ID-9f6b36fd-a680-42db-a6f4-0ea21b355bc2">Terraform</a>によるサブドメイン設定方法。
また、サブドメインもまとめてHTTPS化するため、ワイルドカードを含んだSSL証明書を発行する。
</p>

<p>
<a href="https://budougumi0617.github.io/2020/11/07/define_https_subdomain_by_terraform/">TerraformでAWS上にHTTPS化したサブドメインを定義する - My External Storage</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org474708c" class="outline-2">
<h2 id="org474708c"><a href="#org474708c">Tasks</a></h2>
</div>
<div id="outline-container-org8d5cef2" class="outline-2">
<h2 id="org8d5cef2"><a href="#org8d5cef2">Reference</a></h2>
</div>
<div id="outline-container-orgf6cea2a" class="outline-2">
<h2 id="orgf6cea2a"><a href="#orgf6cea2a">Archives</a></h2>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
